In [17]:
!pip install psycopg2-binary

Requirement already satisfied: psycopg2-binary in ./opt/anaconda3/lib/python3.9/site-packages (2.9.9)

In [18]:
import psycopg2

# Replace the placeholders with your actual database details
dbname = 'retail_db_1'
user = 'retail_user_1'
password = '12345678'
host = '127.0.0.1'
port = '5432'  # or your custom port


# Establish the connection
try:
    conn = psycopg2.connect(
        dbname=dbname,
        user=user,
        password=password,
        host=host,
        port=port
    )
    print("Connected to the database.")
    # You can now use `conn` to perform database operations.
    
    conn.close()
except Exception as e:
    print("Unable to connect to the database:", e)

Connected to the database.

In [19]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [20]:
%sql postgresql://retail_user_1:12345678@127.0.0.1:5432/retail_db_1

In [21]:
%sql select count(*) from departments;

 * postgresql://retail_user_1:***@127.0.0.1:5432/retail_db_1
1 rows affected.

[(6,)]

In [22]:
%sql select distinct order_status from orders order by 1;

 * postgresql://retail_user_1:***@127.0.0.1:5432/retail_db_1
9 rows affected.

[('CANCELED',),
 ('CLOSED',),
 ('COMPLETE',),
 ('ON_HOLD',),
 ('PAYMENT_REVIEW',),
 ('PENDING',),
 ('PENDING_PAYMENT',),
 ('PROCESSING',),
 ('SUSPECTED_FRAUD',)]

In [23]:
%%sql

select count(distinct order_date) from orders;

 * postgresql://retail_user_1:***@127.0.0.1:5432/retail_db_1
1 rows affected.

[(364,)]

In [24]:
%%sql

select sum(order_item_subtotal) from order_items
where order_item_order_id = 2;

 * postgresql://retail_user_1:***@127.0.0.1:5432/retail_db_1
1 rows affected.

[(579.98,)]

In [25]:
%%sql

select order_item_order_id, round(sum(order_item_subtotal)::numeric,2) as order_revenue 
from order_items
group by order_item_order_id
order by order_item_order_id
limit 10;

 * postgresql://retail_user_1:***@127.0.0.1:5432/retail_db_1
10 rows affected.

[(1, Decimal('299.98')),
 (2, Decimal('579.98')),
 (4, Decimal('699.85')),
 (5, Decimal('1129.86')),
 (7, Decimal('579.92')),
 (8, Decimal('729.84')),
 (9, Decimal('599.96')),
 (10, Decimal('651.92')),
 (11, Decimal('919.79')),
 (12, Decimal('1299.87'))]

In [26]:
%%sql


select order_date, count(*) as order_count
from orders
where order_status in ('COMPLETE','CLOSED')
group by 1
order by 2 desc
limit 10;

 * postgresql://retail_user_1:***@127.0.0.1:5432/retail_db_1
10 rows affected.

[(datetime.datetime(2013, 11, 3, 0, 0), 146),
 (datetime.datetime(2013, 10, 4, 0, 0), 127),
 (datetime.datetime(2013, 9, 14, 0, 0), 126),
 (datetime.datetime(2013, 11, 5, 0, 0), 126),
 (datetime.datetime(2013, 11, 11, 0, 0), 125),
 (datetime.datetime(2013, 11, 14, 0, 0), 125),
 (datetime.datetime(2013, 11, 30, 0, 0), 125),
 (datetime.datetime(2014, 6, 19, 0, 0), 124),
 (datetime.datetime(2014, 5, 6, 0, 0), 123),
 (datetime.datetime(2014, 4, 21, 0, 0), 123)]

In [27]:
%%sql

select order_date, count(*) as order_count
from orders
where order_status in ('COMPLETE','CLOSED')
group by 1
	having count(*) >= 100
order by 2 desc
limit 10;

 * postgresql://retail_user_1:***@127.0.0.1:5432/retail_db_1
10 rows affected.

[(datetime.datetime(2013, 11, 3, 0, 0), 146),
 (datetime.datetime(2013, 10, 4, 0, 0), 127),
 (datetime.datetime(2013, 11, 5, 0, 0), 126),
 (datetime.datetime(2013, 9, 14, 0, 0), 126),
 (datetime.datetime(2013, 11, 11, 0, 0), 125),
 (datetime.datetime(2013, 11, 30, 0, 0), 125),
 (datetime.datetime(2013, 11, 14, 0, 0), 125),
 (datetime.datetime(2014, 6, 19, 0, 0), 124),
 (datetime.datetime(2013, 8, 6, 0, 0), 123),
 (datetime.datetime(2014, 4, 21, 0, 0), 123)]

In [28]:
%%sql

select order_item_order_id, round(sum(order_item_subtotal)::numeric,2) as order_revenue 
from order_items
group by 1
	having round(sum(order_item_subtotal)::numeric,2) >= 2000
order by 2;

 * postgresql://retail_user_1:***@127.0.0.1:5432/retail_db_1
17 rows affected.

[(22030, Decimal('2039.80')),
 (68883, Decimal('2149.99')),
 (68722, Decimal('2199.99')),
 (68736, Decimal('2259.95')),
 (68837, Decimal('2299.96')),
 (68816, Decimal('2329.94')),
 (68859, Decimal('2349.89')),
 (68875, Decimal('2399.95')),
 (68848, Decimal('2399.96')),
 (68778, Decimal('2629.90')),
 (68806, Decimal('2629.92')),
 (68821, Decimal('2629.92')),
 (68766, Decimal('2699.90')),
 (68809, Decimal('2779.86')),
 (68858, Decimal('2839.91')),
 (68724, Decimal('2859.89')),
 (68703, Decimal('3449.91'))]

In [29]:
%%sql

select o1.order_id,
    o1.order_customer_id,
    o2.order_item_order_id,
    o2.order_item_subtotal
from orders as o1
Inner join order_items as o2
on o1.order_id = o2.order_item_order_id
limit 10;

 * postgresql://retail_user_1:***@127.0.0.1:5432/retail_db_1
10 rows affected.

[(1, 11599, 1, 299.98),
 (2, 256, 2, 199.99),
 (2, 256, 2, 250.0),
 (2, 256, 2, 129.99),
 (4, 8827, 4, 49.98),
 (4, 8827, 4, 299.95),
 (4, 8827, 4, 150.0),
 (4, 8827, 4, 199.92),
 (5, 11318, 5, 299.98),
 (5, 11318, 5, 299.95)]

In [30]:
%%sql

select o1.order_id,
    o1.order_customer_id,
    o2.order_item_order_id,
    o2.order_item_subtotal
from orders as o1
left outer join order_items as o2
on o1.order_id = o2.order_item_order_id
limit 10;

 * postgresql://retail_user_1:***@127.0.0.1:5432/retail_db_1
10 rows affected.

[(1, 11599, 1, 299.98),
 (2, 256, 2, 199.99),
 (2, 256, 2, 250.0),
 (2, 256, 2, 129.99),
 (4, 8827, 4, 49.98),
 (4, 8827, 4, 299.95),
 (4, 8827, 4, 150.0),
 (4, 8827, 4, 199.92),
 (5, 11318, 5, 299.98),
 (5, 11318, 5, 299.95)]

In [31]:
%%sql

select o1.order_id,
    o1.order_customer_id,
    o2.order_item_order_id,
    o2.order_item_subtotal
from orders as o1
full outer join order_items as o2
on o1.order_id = o2.order_item_order_id
limit 10;

 * postgresql://retail_user_1:***@127.0.0.1:5432/retail_db_1
10 rows affected.

[(1, 11599, 1, 299.98),
 (2, 256, 2, 199.99),
 (2, 256, 2, 250.0),
 (2, 256, 2, 129.99),
 (4, 8827, 4, 49.98),
 (4, 8827, 4, 299.95),
 (4, 8827, 4, 150.0),
 (4, 8827, 4, 199.92),
 (5, 11318, 5, 299.98),
 (5, 11318, 5, 299.95)]

In [32]:
%%sql

select o1.order_date,
    o2.order_item_order_id,
    round(sum(o2.order_item_subtotal)::numeric,2) as order_revenue
from orders as o1
    Inner join order_items as o2
        on o1.order_id = o2.order_item_order_id
group by o1.order_date, o2.order_item_order_id
order by 1,3
limit 10;

 * postgresql://retail_user_1:***@127.0.0.1:5432/retail_db_1
10 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), 57777, Decimal('79.98')),
 (datetime.datetime(2013, 7, 25, 0, 0), 48, Decimal('99.96')),
 (datetime.datetime(2013, 7, 25, 0, 0), 93, Decimal('99.96')),
 (datetime.datetime(2013, 7, 25, 0, 0), 30, Decimal('100.00')),
 (datetime.datetime(2013, 7, 25, 0, 0), 87, Decimal('119.97')),
 (datetime.datetime(2013, 7, 25, 0, 0), 74, Decimal('119.98')),
 (datetime.datetime(2013, 7, 25, 0, 0), 97, Decimal('124.95')),
 (datetime.datetime(2013, 7, 25, 0, 0), 13, Decimal('127.96')),
 (datetime.datetime(2013, 7, 25, 0, 0), 35, Decimal('129.99')),
 (datetime.datetime(2013, 7, 25, 0, 0), 57787, Decimal('129.99'))]

In [33]:
%%sql 

CREATE OR REPLACE VIEW order_items_view
AS
select o1.*,
	o2.order_item_product_id,
	o2.order_item_quantity,
	o2.order_item_subtotal
from orders AS o1
JOIN order_items AS o2
on o1.order_id = o2.order_item_order_id;

 * postgresql://retail_user_1:***@127.0.0.1:5432/retail_db_1
Done.

[]

In [34]:
%%sql

select * from order_items_view order by order_date limit 10;

 * postgresql://retail_user_1:***@127.0.0.1:5432/retail_db_1
10 rows affected.

[(2, datetime.datetime(2013, 7, 25, 0, 0), 256, 'PENDING_PAYMENT', 502, 5, 250.0),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 256, 'PENDING_PAYMENT', 403, 1, 129.99),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 8827, 'CLOSED', 897, 2, 49.98),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 8827, 'CLOSED', 365, 5, 299.95),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 8827, 'CLOSED', 502, 3, 150.0),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 8827, 'CLOSED', 1014, 4, 199.92),
 (7, datetime.datetime(2013, 7, 25, 0, 0), 4530, 'COMPLETE', 1073, 1, 199.99),
 (7, datetime.datetime(2013, 7, 25, 0, 0), 4530, 'COMPLETE', 957, 1, 299.98),
 (7, datetime.datetime(2013, 7, 25, 0, 0), 4530, 'COMPLETE', 926, 5, 79.95),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 256, 'PENDING_PAYMENT', 1073, 1, 199.99)]

In [35]:
%%sql

select * 
from products as p
    left outer join order_items_view as otv
        on p.product_id = otv.order_item_product_id
            and to_char(otv.order_date::timestamp, 'yyyy-MM') = '2014-01'
where otv.order_item_product_id is NULL limit 10;

 * postgresql://retail_user_1:***@127.0.0.1:5432/retail_db_1
10 rows affected.

[(1, 2, 'Quest Q64 10 FT. x 10 FT. Slant Leg Instant U', '', 59.98, 'http://images.acmesports.sports/Quest+Q64+10+FT.+x+10+FT.+Slant+Leg+Instant+Up+Canopy', None, None, None, None, None, None, None),
 (2, 2, "Under Armour Men's Highlight MC Football Clea", '', 129.99, 'http://images.acmesports.sports/Under+Armour+Men%27s+Highlight+MC+Football+Cleat', None, None, None, None, None, None, None),
 (3, 2, "Under Armour Men's Renegade D Mid Football Cl", '', 89.99, 'http://images.acmesports.sports/Under+Armour+Men%27s+Renegade+D+Mid+Football+Cleat', None, None, None, None, None, None, None),
 (4, 2, "Under Armour Men's Renegade D Mid Football Cl", '', 89.99, 'http://images.acmesports.sports/Under+Armour+Men%27s+Renegade+D+Mid+Football+Cleat', None, None, None, None, None, None, None),
 (5, 2, 'Riddell Youth Revolution Speed Custom Footbal', '', 199.99, 'http://images.acmesports.sports/Riddell+Youth+Revolution+Speed+Custom+Football+Helmet', None, None, None, None, None, None, None),
 (6, 2, "Jordan Men's VI Retro TD Football Cleat", '', 134.99, 'http://images.acmesports.sports/Jordan+Men%27s+VI+Retro+TD+Football+Cleat', None, None, None, None, None, None, None),
 (7, 2, 'Schutt Youth Recruit Hybrid Custom Football H', '', 99.99, 'http://images.acmesports.sports/Schutt+Youth+Recruit+Hybrid+Custom+Football+Helmet+2014', None, None, None, None, None, None, None),
 (8, 2, "Nike Men's Vapor Carbon Elite TD Football Cle", '', 129.99, 'http://images.acmesports.sports/Nike+Men%27s+Vapor+Carbon+Elite+TD+Football+Cleat', None, None, None, None, None, None, None),
 (9, 2, 'Nike Adult Vapor Jet 3.0 Receiver Gloves', '', 50.0, 'http://images.acmesports.sports/Nike+Adult+Vapor+Jet+3.0+Receiver+Gloves', None, None, None, None, None, None, None),
 (10, 2, "Under Armour Men's Highlight MC Football Clea", '', 129.99, 'http://images.acmesports.sports/Under+Armour+Men%27s+Highlight+MC+Football+Cleat', None, None, None, None, None, None, None)]

In [36]:
%%sql

select o1.order_date,
    round(sum(o2.order_item_subtotal)::numeric,2) as order_revenue
from orders as o1
    Inner join order_items as o2
        on o1.order_id = o2.order_item_order_id
where o1.order_status in ('COMPLETE','CLOSED')
group by o1.order_date
order by 1
limit 10;

 * postgresql://retail_user_1:***@127.0.0.1:5432/retail_db_1
10 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), Decimal('31547.23')),
 (datetime.datetime(2013, 7, 26, 0, 0), Decimal('54713.23')),
 (datetime.datetime(2013, 7, 27, 0, 0), Decimal('48411.48')),
 (datetime.datetime(2013, 7, 28, 0, 0), Decimal('35672.03')),
 (datetime.datetime(2013, 7, 29, 0, 0), Decimal('54579.70')),
 (datetime.datetime(2013, 7, 30, 0, 0), Decimal('49329.29')),
 (datetime.datetime(2013, 7, 31, 0, 0), Decimal('59212.49')),
 (datetime.datetime(2013, 8, 1, 0, 0), Decimal('49160.08')),
 (datetime.datetime(2013, 8, 2, 0, 0), Decimal('50688.58')),
 (datetime.datetime(2013, 8, 3, 0, 0), Decimal('43416.74'))]